/**
 * Класс для хранения рисунков виселицы и передачи их по индексу
 **/
public class GamePictures {

    private static final String[] PICTURES = {
            """
    -------   
    |       
    |       
    |       
    |       
    ------- 
    """,
            """
     -----   
     |   |   
     |   O   
     |       
     |       
     ------- 
     """
            ,
            """
     -------   
     |   |   
     |   O   
     |   |  
     |       
     ------- 
     """,
            """
     -------   
     |   |   
     |   O   
     |  /|  
     |  
     ------- 
     """,
            """
     -------   
     |   |   
     |   O   
     |  /|\\  
     |  
     ------- 
     """,
            """
     -------   
     |   |   
     |   O   
     |  /|\\  
     |  / 
     ------- 
     """,
            """
     -------   
     |   |   
     |   O   
     |  /|\\  
     |  / \\
     ------- 
     """,
    };

    public String getPICTURE(int errors) {
        return PICTURES[errors];
    }
}
